{"pageProps":{"articles":[{"title":"‘The Hero of Mistpeak’ is Born","description":"\nAn interview with author James H. Reaver about the new play on one of the most successful video game series of all time.\nHello James! How are you doing today?Hey there! Great it’s a pleasure to be here.\nThank you for wanting to answer a few questions about your newly released work. Before we get in","link":"https://medium.com/p/0ff2c2865d3c","date":"2024-07-28 15:22:17"},{"title":"The Beauty of a Play","description":"\nWhy should anyone read a theatre play? Why might anyone write it in the first place? And what do plays have that novels do not?\nOften I get asked why I decided to become a playwright rather than a novelist. Truth be told, I began my writing journey as an author of prose. Later on, however, I starte","link":"https://medium.com/p/e223fee4ae5a","date":"2024-06-04 08:00:19"},{"title":"The end-of-year State of Play","description":"\nQuite literally, where are we at with this “play”? As the year draws to a close, I want to explore what has been and what will be.\nIt’s been a while since I wrote an update on Medium. This is because I’ve been writing and coding and writing and coding on all sorts of other means. But all this work ","link":"https://medium.com/p/ec46fe2a1a5d","date":"2023-09-26 11:00:03"},{"title":"The most difficult English poem","description":"\nThe Chaos — English’s most gruelling verses read by me.\nI have always been incredibly fascinated by phonetics and pronunciation. A few years ago I set myself to learn all the IPA (International Phonetic Alphabet) sounds for the English language, and in doing so, I stumbled across a poem by the Dutc","link":"https://medium.com/p/d9b47b1cbdb2","date":"2022-05-07 18:38:01"},{"title":"The five things I want to be.","description":"\nThis is the first article I write about a personal topic such as my long term goals —and I mean long— term. It’s very much a “Dear Diary,” kind of post.\nI have the intention to sketch a simple outline of my mindset and my objectives the way they stand in my early twenties. I’ve been known for alway","link":"https://medium.com/p/e25ad4117f4b","date":"2020-07-16 13:34:10"},{"title":"Can you control your social media?","description":"\nOccasionally bursting the social media bubble surrounding us may do wonders for our determination and our quest for real connections, as well as nudging us towards the choice of memories over ‘stories’.\nEarlier this year, the ups and downs of life made me think about my use of social media. Social ","link":"https://medium.com/p/20f71c19bceb","date":"2020-05-20 17:20:40"}]},"__N_SSG":true}